[["2488853", "1.2", "at Constant time  b Lineartime  ct Logarithmic time d Polynomial time et Exponential time"], ["2488853", "1.3", "An abstract machine is a therotical model of a computer software or hardware system used in automata theory."], ["2488853", "1.1", "A process or set of rules to be followed to solve a problem specially by computers"], ["2488854", "1.2", "constant time  t linear time  t logarithmic time . polynomial time . Exponential time"], ["2488854", "1.3", "An abstruot machine is treoritioal model of a computer hardware or software system used in automata theory"], ["2488854", "1.1", "an algorithm is a step by step method of solving a problem. It is commonly used for data processing, calculation and other related computer and mathematical operations.An algorithm is  also used to manipulate data in various ways, such as inserting a new data item, searching for a particular item or sorting an item."], ["2488854", "2.1", "Clock synchronization is a topic in computer science and engineering that aims to coordinate otherwise independent clocks. Even when initially set accurately, real clocks will differ after some amount"], ["2488854", "2.2", "A computer network is a group of computer systems and other computing hardware devices that are linked together through communication channels to facilitate communication and resource-sharing among a"], ["2488854", "2.3", "A distributed system is a system whose components are located on different networked  computers, which communicate and coordinate their actions by passing messages to one another"], ["2488853", "2.1", "test answer for question number 2.1"], ["2488853", "2.2", "test answer for question number 2.2"], ["2488853", "2.3", "Test answer for question number 2.3"], ["2488853", "3.1", "Test ans of question 3.1"], ["2488856", "1.2", "at Constant time  b Lineartime  ct Logarithmic time d Polynomial time et Exponential time"], ["2488856", "1.3", "An abstract machine is a therotical model of a computer software or hardware system used in automata theory."], ["2488856", "1.1", "i really dont dont know what algorithm is. but i certainly know it is used in computer to solve a porblem."], ["2488855", "1.2", "constant time  t linear time  t logarithmic time . polynomial time . Exponential time"], ["2488855", "1.3", "An abstruot machine is treoritioal model of a computer hardware or software system used in automata theory"], ["2488855", "1.1", "i really dont dont know what algorithm is. but i certainly know it is used in computer to solve a porblem.  in computer to solve a problem"]]